[
  {
    "id": "ca071353-0c9e-40a1-a19c-6fda47492a28",
    "title": "The Godfather",
    "director": "Francis Ford Coppola",
    "actors": [
      "Marlon Brando",
      "Al Pacino",
      "Diane Keaton"
    ],
    "description": "Widely regarded as one of the greatest films of all time, this mob drama, based on Mario Puzo's novel of the same name, focuses on the powerful Italian-American crime family of Don Vito Corleone (Marlon Brando). When the don's youngest son, Michael (Al Pacino), reluctantly joins the Mafia, he becomes involved in the inevitable cycle of violence and betrayal. Although Michael tries to maintain a normal relationship with his wife, Kay (Diane Keaton), he is drawn deeper into the family business.",
    "thumbnail": "https://m.media-amazon.com/images/M/MV5BM2MyNjYxNmUtYTAwNi00MTYxLWJmNWYtYzZlODY3ZTk3OTFlXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg"
  },
  {
    "id": "e8568633-6eca-41f3-b4db-5ace93148598",
    "title": "Star Wars: The Last Jedi",
    "director": "Rian Johnson",
    "actors": [
      "Daisy Ridley",
      "Mark Hamill",
      "John Boyega"
    ],
    "description": "Luke Skywalker's peaceful and solitary existence gets upended when he encounters Rey, a young woman who shows strong signs of the Force. Her desire to learn the ways of the Jedi forces Luke to make a decision that changes their lives forever. Meanwhile, Kylo Ren and General Hux lead the First Order in an all-out assault against Leia and the Resistance for supremacy of the galaxy.",
    "thumbnail": "https://images-na.ssl-images-amazon.com/images/I/51poKKV63GL.jpg"
  },
  {
    "id": "d33cdf5e-9323-416c-af27-9511f93d48b7",
    "title": "Spider-Man: Homecoming",
    "director": "Jon Watts",
    "actors": [
      "Tom Holland",
      "Michael Keaton",
      "Robert Downey, Jr."
    ],
    "description": "Thrilled by his experience with the Avengers, young Peter Parker returns home to live with his Aunt May. Under the watchful eye of mentor Tony Stark, Parker starts to embrace his newfound identity as Spider-Man. He also tries to return to his normal daily routine -- distracted by thoughts of proving himself to be more than just a friendly neighborhood superhero. Peter must soon put his powers to the test when the evil Vulture emerges to threaten everything that he holds dear.",
    "thumbnail": "https://images.complex.com/complex/images/c_limit,w_680/fl_lossy,pg_1,q_auto/uc7ae2rek8ne8ov0ue8e/spider-man-homecoming-poster"
  }
]